; domain
(define (domain Q1)
  (:requirements :strips :typing :negative-preconditions)
  (:types robot location slot component status equipment damage - object
      ;;physical object
      tool sensor part - equipment
      antenna-bracket radiator - component
      torque-wrench grasping-tool coolant-bypass additive-extruder - tool 
      visual-camera profilometer - sensor
      spare-bracket unload coolant-reservoir print-material - part
      storage - location)
  (:constants   ;;state global concepts
      unknown inspected nominal degraded repaired verified - status 
      is-loose cracked-bracket coolant-leak structural-deformation - damage)
  (:predicates  
    ;; Component state
    (state ?c - component ?s - status)

    ;; Robot state
    (robot-at ?r - robot ?loc - location)           ;;robot position
    (component-at ?c - component ?loc - location)   ;;component position
    (equipment-at ?e - equipment ?loc - location)   ;;equipment position
    (slot-free ?r - robot ?sl - slot)                        ;;robot has free slot
    (in-slot ?r - robot ?e - equipment ?sl - slot)      ;;equipment is in slot
    (handempty ?r - robot)                      ;;robot has no tool in hand
    (has-equipment ?r - robot ?e - equipment)   ;;robot has equipment in hand      
    (sensor-compatible ?c - component ?s - sensor)       ;;sensor compatibility with the component

    ;; Location state
    (connected ?loc1 - location ?loc2 - location)   ;;NO symmetry

    ;; Ispection
    (data-stored ?c - component ?s - sensor)

    ;; Diagnosis
    (healthy ?c - component)
    (component-damaged ?c - component ?d - damage)
    (damage-sensor-compatible ?d - damage ?s - sensor) 

    ;; Repair
    (damage-tool-compatible ?d - damage ?t - tool)
    (is-new ?sp - part)    ;;spare part to insert
    (is-broken ?sp - part) ;;component substituted
    (become-unload ?c - component ?u - unload)  ;;the substituted componend become unload
  )

  ;;-----------------------------------------------

  ;; EQUIPMENT (tool/sensor/part) MOVEMENT
  ;; take equipment (tool or sensor) from storage 
  (:action unstore-equipment
      :parameters (?r - robot ?loc - storage ?e - equipment)      
      :precondition (and   
          (robot-at ?r ?loc)
          (equipment-at ?e ?loc)
          (handempty ?r))
      :effect (and                
          (not (equipment-at ?e ?loc))
          (not (handempty ?r))
          (has-equipment ?r ?e)))
  
  ;; put equipment (tool/sensor/part) in storage
  (:action store-equipment
      :parameters (?r - robot ?loc - storage ?e - equipment)      
      :precondition (and   
          (robot-at ?r ?loc)
          (has-equipment ?r ?e)
          (not (handempty ?r)))
      :effect (and                
          (equipment-at ?e ?loc)
          (handempty ?r)
          (not (has-equipment ?r ?e))))

  ;; take equipment (tool/sensor/part) from storage 
  (:action take-from-slot
      :parameters (?r - robot ?s - slot ?e - equipment)      
      :precondition (and   
          (in-slot ?r ?e ?s)
          (handempty ?r))
      :effect (and                
          (not (in-slot ?r ?e ?s))
          (slot-free ?r ?s)
          (not (handempty ?r))
          (has-equipment ?r ?e)))

  ;; put equipment (tool/sensor/part) in slot
  (:action put-in-slot
      :parameters (?r - robot ?e - equipment ?s - slot)      
      :precondition (and 
          (slot-free ?r ?s)
          (not (handempty ?r))
          (has-equipment ?r ?e))
      :effect (and            
          (handempty ?r)
          (not (slot-free ?r ?s))
          (in-slot ?r ?e ?s)
          (not (has-equipment ?r ?e)))
  )


  ;;------------------------------------------
  ;; MOVE ROBOT
  (:action move 
      :parameters (?r - robot ?from ?to - location)      
      :precondition (and
          (robot-at ?r ?from) 
          (connected ?from ?to))
      :effect (and
          (not (robot-at ?r ?from))
          (robot-at ?r ?to)))
  ;;---------------------------------------------

  ;; INSPECTION
  ;; sensor collects data on the component and active the 'inspected' state

  (:action inspect-component
      :parameters (?r - robot ?c - component ?loc - location ?s - sensor)
      :precondition (and
          (state ?c unknown)
          (robot-at ?r ?loc)
          (component-at ?c ?loc)
          (has-equipment ?r ?s)
          (sensor-compatible ?c ?s)
      )  
      :effect(and
          (not (state ?c unknown))
          (state ?c inspected)
          (data-stored ?c ?s)))
  ;;--------------------------------------------- 

  ;; DIAGNOSIS
  ;; used inspected dato to detect the component problem and active the 'diagnosed' state
  (:action degraded-diagnosis
      :parameters (?c - component ?d - damage ?s - sensor)
      :precondition (and
          (state ?c inspected)
          (data-stored ?c ?s)
          (component-damaged ?c ?d)
          (damage-sensor-compatible ?d ?s))
      :effect (and
          (not (state ?c inspected))
          (not (data-stored ?c ?s))
          (state ?c degraded)))

  ;; if the component is not degraded, active 'nominal' state
  (:action nominal-diagnosis
      :parameters (?c - component ?s - sensor)
      :precondition (and
          (state ?c inspected)
          (data-stored ?c ?s)            
          (healthy ?c))
      :effect (and
          (not (state ?c inspected))
          (not (data-stored ?c ?s))      
          (state ?c nominal)))
  ;;-----------------------------------------------------

  ;; REPAIR
  ;; every component has its own way to be repaired, based on tools

  ;; Loose ANTENNA
  ;; repaired with a torque-wrench tool
  (:action loose-antenna-reparation
      :parameters (?r - robot ?loc - location ?c - antenna-bracket ?t - torque-wrench)
      :precondition (and
          (state ?c degraded)
          (component-damaged ?c is-loose)
          (robot-at ?r ?loc)
          (component-at ?c ?loc)
          (has-equipment ?r ?t)
          (damage-tool-compatible is-loose ?t))
      :effect (and
          (not (component-damaged ?c is-loose))
          (not (state ?c degraded))
          (state ?c repaired))) 

  ;; cracked ANTENNA
  ;; repaired with a substitution thru grasping-tool
  (:action cracked-bracket-reparation
      :parameters (?r - robot ?loc - location ?c - antenna-bracket ?t - grasping-tool ?sp - spare-bracket ?sl - slot ?u - unload)
      :precondition (and
          (state ?c degraded)
          (component-damaged ?c cracked-bracket)
          (damage-tool-compatible cracked-bracket ?t)
          (robot-at ?r ?loc)
          (component-at ?c ?loc)
          (has-equipment ?r ?t)
          (in-slot ?r ?sp ?sl)
          (is-new ?sp)
          (become-unload ?c ?u))
      :effect (and
          (not (component-damaged ?c cracked-bracket))
          (not (state ?c degraded))
          (not (in-slot ?r ?sp ?sl))    
          (in-slot ?r ?u ?sl)      
          (is-broken ?u)
          (state ?c repaired)))

  ;; coolant-leak RADIATOR
  ;; repaired with an addiction of coolant thru coolant-bypass-tool
  (:action coolant-radiator-reparation
      :parameters (?r - robot ?loc - location ?c - radiator ?t - coolant-bypass ?p - coolant-reservoir ?sl - slot)
      :precondition (and
          (state ?c degraded)
          (component-damaged ?c coolant-leak)
          (damage-tool-compatible coolant-leak ?t)
          (robot-at ?r ?loc)
          (component-at ?c ?loc)
          (in-slot ?r ?p ?sl)
          (has-equipment ?r ?t)
          (is-new ?p))
      :effect (and
          (not (component-damaged ?c coolant-leak))
          (not (is-new ?p))
          (not (state ?c degraded))  
          (state ?c repaired)))

  ;; structural-deformation RADIATOR
  ;; repaired with an addiction of print-material thru extrusion materials
  (:action structural-deformation-reparation
    :parameters (?r - robot ?loc - location ?c - radiator ?t - additive-extruder ?m - print-material ?sl - slot)
    :precondition (and
        (state ?c degraded)
        (component-damaged ?c structural-deformation)
        (damage-tool-compatible structural-deformation ?t)
        (robot-at ?r ?loc)
        (component-at ?c ?loc)
        (has-equipment ?r ?t)
        (in-slot ?r ?m ?sl)
        (is-new ?m))
    :effect (and
        (not (component-damaged ?c structural-deformation))
        (not (is-new ?m))
        (not (state ?c degraded))
        (state ?c repaired)))
  ;;---------------------------------------------------------------

  ;; VERIFIED
  ;; convalidate the nominal status of the component
  (:action repaired-verify
      :parameters (?r - robot ?c - component ?loc - location ?s - sensor)
      :precondition (and
          (state ?c repaired)
          (robot-at ?r ?loc)
          (component-at ?c ?loc)
          (has-equipment ?r ?s)
          (sensor-compatible ?c ?s)
      )  
      :effect(and
          (not (state ?c repaired))
          (state ?c verified)))

  ;; formal verification
  (:action nominal-verify
      :parameters (?c - component)
      :precondition (state ?c nominal)
      :effect (and
          (not (state ?c nominal))     
          (state ?c verified)))
)

; problem
;; Problem2: non-trivial instance with multiple components and limited resources.
;;      Damaged parts are the cracked-bracket antenna and the coolant-leak radiator.
;;      The cracked antenna is repaired with a substituion(spare-bracket1) of the part helped by grasping tool. It generated a trash part(antenna1-debris).
;;      The coolant-leak requires the coolant-bypass tool(cbypass1) and a consumable resource (creserver1) that will be 'emptied'.
;;      Therefore, the robot can use only 3-slots.

(define (problem Q1-Testingproblem)
  (:domain Q1)

  (:objects
    R - robot
    docking-port antenna-site radiator-site - location
    esp-storage - storage
    slot1 slot2 slot3 - slot

    ;; ANTENNA cracked-bracket
    antenna1 - antenna-bracket
    cam1 - visual-camera
    grasper1 - grasping-tool
    spare-bracket1 - spare-bracket
    antenna1-debris - unload

    ;; RADIATOR coolant-leak
    radiator1 - radiator
    profilometer1 - profilometer
    cbypass1 - coolant-bypass
    creserver1 - coolant-reservoir
  )
  
  (:init
    ;; Maps connections
    (connected docking-port esp-storage)
    (connected esp-storage docking-port)
    (connected esp-storage antenna-site)
    (connected antenna-site esp-storage)
    (connected esp-storage radiator-site)
    (connected radiator-site esp-storage)

    ;; Original state R
    (robot-at R docking-port)
    (handempty R)
    (slot-free R slot1)
    (slot-free R slot2)
    (slot-free R slot3)

    ;; --- Damaged component:
    ;;ANTENNA
    (component-at antenna1 antenna-site)
    (state antenna1 unknown)
    (become-unload antenna1 antenna1-debris)
    (component-damaged antenna1 cracked-bracket)  
    
    ;;RADIATOR
    (component-at radiator1 radiator-site)
    (state radiator1 unknown)
    (component-damaged radiator1 coolant-leak)  
    

    ;; Equipment in esp-storage
        ;; sensor:
    (equipment-at cam1 esp-storage)
    (equipment-at profilometer1 esp-storage)
        ;; tool:
    (equipment-at grasper1 esp-storage)
    (equipment-at cbypass1 esp-storage)
        ;; part
    (equipment-at spare-bracket1 esp-storage)
    (is-new spare-bracket1)
    (equipment-at creserver1 esp-storage)
    (is-new creserver1)


    ;; --- Compatibility

    ;; ANTENNA
    (sensor-compatible antenna1 cam1) 
    (damage-sensor-compatible cracked-bracket cam1)  
    (damage-tool-compatible cracked-bracket grasper1) 

    ;; RADIATOR 
    (sensor-compatible radiator1 profilometer1)     
    (damage-sensor-compatible coolant-leak profilometer1)
    (damage-tool-compatible coolant-leak cbypass1)
  )
  
  (:goal (and (state antenna1 verified) (state radiator1 verified)))    
)

; plan
1. (move r docking-port esp-storage)
   deleted: (robot-at r docking-port)
   added: (robot-at r esp-storage)
   goals met: 0 of 2
2. (unstore-equipment r esp-storage cam1)
   deleted: (equipment-at cam1 esp-storage) (handempty r)
   added: (has-equipment r cam1)
   goals met: 0 of 2
3. (move r esp-storage antenna-site)
   deleted: (robot-at r esp-storage)
   added: (robot-at r antenna-site)
   goals met: 0 of 2
4. (inspect-component r antenna1 antenna-site cam1)
   deleted: (state antenna1 unknown)
   added: (state antenna1 inspected) (data-stored antenna1 cam1)
   goals met: 0 of 2
5. (degraded-diagnosis antenna1 cracked-bracket cam1)
   deleted: (state antenna1 inspected) (data-stored antenna1 cam1)
   added: (state antenna1 degraded)
   goals met: 0 of 2
6. (move r antenna-site esp-storage)
   deleted: (robot-at r antenna-site)
   added: (robot-at r esp-storage)
   goals met: 0 of 2
7. (put-in-slot r cam1 slot1)
   deleted: (slot-free r slot1) (has-equipment r cam1)
   added: (handempty r) (in-slot r cam1 slot1)
   goals met: 0 of 2
8. (unstore-equipment r esp-storage profilometer1)
   deleted: (equipment-at profilometer1 esp-storage) (handempty r)
   added: (has-equipment r profilometer1)
   goals met: 0 of 2
9. (move r esp-storage radiator-site)
   deleted: (robot-at r esp-storage)
   added: (robot-at r radiator-site)
   goals met: 0 of 2
10. (inspect-component r radiator1 radiator-site profilometer1)
   deleted: (state radiator1 unknown)
   added: (state radiator1 inspected) (data-stored radiator1 profilometer1)
   goals met: 0 of 2
11. (degraded-diagnosis radiator1 coolant-leak profilometer1)
   deleted: (state radiator1 inspected) (data-stored radiator1 profilometer1)
   added: (state radiator1 degraded)
   goals met: 0 of 2
12. (move r radiator-site esp-storage)
   deleted: (robot-at r radiator-site)
   added: (robot-at r esp-storage)
   goals met: 0 of 2
13. (store-equipment r esp-storage profilometer1)
   deleted: (has-equipment r profilometer1)
   added: (equipment-at profilometer1 esp-storage) (handempty r)
   goals met: 0 of 2
14. (unstore-equipment r esp-storage creserver1)
   deleted: (equipment-at creserver1 esp-storage) (handempty r)
   added: (has-equipment r creserver1)
   goals met: 0 of 2
15. (put-in-slot r creserver1 slot3)
   deleted: (slot-free r slot3) (has-equipment r creserver1)
   added: (handempty r) (in-slot r creserver1 slot3)
   goals met: 0 of 2
16. (unstore-equipment r esp-storage cbypass1)
   deleted: (equipment-at cbypass1 esp-storage) (handempty r)
   added: (has-equipment r cbypass1)
   goals met: 0 of 2
17. (move r esp-storage radiator-site)
   deleted: (robot-at r esp-storage)
   added: (robot-at r radiator-site)
   goals met: 0 of 2
18. (coolant-radiator-reparation r radiator-site radiator1 cbypass1 creserver1 slot3)
   deleted: (component-damaged radiator1 coolant-leak) (is-new creserver1) (state radiator1 degraded)
   added: (state radiator1 repaired)
   goals met: 0 of 2
19. (move r radiator-site esp-storage)
   deleted: (robot-at r radiator-site)
   added: (robot-at r esp-storage)
   goals met: 0 of 2
20. (store-equipment r esp-storage cbypass1)
   deleted: (has-equipment r cbypass1)
   added: (equipment-at cbypass1 esp-storage) (handempty r)
   goals met: 0 of 2
21. (unstore-equipment r esp-storage profilometer1)
   deleted: (equipment-at profilometer1 esp-storage) (handempty r)
   added: (has-equipment r profilometer1)
   goals met: 0 of 2
22. (move r esp-storage radiator-site)
   deleted: (robot-at r esp-storage)
   added: (robot-at r radiator-site)
   goals met: 0 of 2
23. (repaired-verify r radiator1 radiator-site profilometer1)
   deleted: (state radiator1 repaired)
   added: (state radiator1 verified)
   goals met: 1 of 2
24. (move r radiator-site esp-storage)
   deleted: (robot-at r radiator-site)
   added: (robot-at r esp-storage)
   goals met: 1 of 2
25. (store-equipment r esp-storage profilometer1)
   deleted: (has-equipment r profilometer1)
   added: (equipment-at profilometer1 esp-storage) (handempty r)
   goals met: 1 of 2
26. (unstore-equipment r esp-storage spare-bracket1)
   deleted: (equipment-at spare-bracket1 esp-storage) (handempty r)
   added: (has-equipment r spare-bracket1)
   goals met: 1 of 2
27. (put-in-slot r spare-bracket1 slot2)
   deleted: (slot-free r slot2) (has-equipment r spare-bracket1)
   added: (handempty r) (in-slot r spare-bracket1 slot2)
   goals met: 1 of 2
28. (unstore-equipment r esp-storage grasper1)
   deleted: (equipment-at grasper1 esp-storage) (handempty r)
   added: (has-equipment r grasper1)
   goals met: 1 of 2
29. (move r esp-storage antenna-site)
   deleted: (robot-at r esp-storage)
   added: (robot-at r antenna-site)
   goals met: 1 of 2
30. (cracked-bracket-reparation r antenna-site antenna1 grasper1 spare-bracket1 slot2 antenna1-debris)
   deleted: (component-damaged antenna1 cracked-bracket) (state antenna1 degraded) (in-slot r spare-bracket1 slot2)
   added: (in-slot r antenna1-debris slot2) (is-broken antenna1-debris) (state antenna1 repaired)
   goals met: 1 of 2
31. (move r antenna-site esp-storage)
   deleted: (robot-at r antenna-site)
   added: (robot-at r esp-storage)
   goals met: 1 of 2
32. (store-equipment r esp-storage grasper1)
   deleted: (has-equipment r grasper1)
   added: (equipment-at grasper1 esp-storage) (handempty r)
   goals met: 1 of 2
33. (move r esp-storage antenna-site)
   deleted: (robot-at r esp-storage)
   added: (robot-at r antenna-site)
   goals met: 1 of 2
34. (take-from-slot r slot1 cam1)
   deleted: (in-slot r cam1 slot1) (handempty r)
   added: (slot-free r slot1) (has-equipment r cam1)
   goals met: 1 of 2
35. (repaired-verify r antenna1 antenna-site cam1)
   deleted: (state antenna1 repaired)
   added: (state antenna1 verified)
   goals met: 2 of 2
